trade_exp/src/Catalogs/ИнтервалыДоставки/ИнтервалыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="790f8dff-28d5-46ce-87ec-875605f8573b">
  <name>ИнтервалыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="ababf069-c0c8-476d-965c-81e896b42038">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="11aa7568-4f6b-4d95-b77a-6648de990a0e">
    <name>ВремяС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="177bd090-bd38-4812-8606-8c6dacceb3d4">
    <name>ВремяПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5f6ddd6a-9ce2-4e89-8324-896f2667fe88">
    <name>КоличествоДоставок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="db6eb09f-e9a5-44cd-81d1-884dd38e2c6d">
    <name>ДеньНедели</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c420361e-1ec9-4179-8056-9dc57f142971">
    <name>ИнтервалЗакрытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4bc74913-8bb1-4d8e-914e-6bdfc8c8689b">
    <name>ВидДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a1d18bc9-dc6c-4e19-a673-a4c6fc2fb79c">
    <name>МксКолДоставокСРазгрузкой</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="55456ee3-7e27-4795-a7bb-216c440e183a">
    <name>НаименованиеНаСайте</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bab7a7d5-47d2-4e3d-b16c-7879686d51c9">
    <name>ЗакрыватьСКонцаИнтервала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf3cea7f-a8c0-450d-a1e0-1af4e3c11936">
    <name>ЭкспрессДоставка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e8ee9426-0e7f-4e38-84d1-1a7a80e9e783">
    <name>ЗакрытиеИнтервалаПоРазгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1e88e37e-f9ed-4160-8573-4f3dd23fd818">
    <name>Тип</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d4ba175c-5e65-40ed-8e54-fe33435b3ade">
    <name>СМС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="63b6364f-bee0-4dc6-8d83-5ce2b2ad85c2">
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ab4e1dc3-002e-4ec2-8419-e1b89bd1101e">
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="61515652-c89c-4de0-950d-034f7fc11df3">
    <name>КоличествоДней</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Enums/ВидыДоставокДоКлиента/ВидыДоставокДоКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВидыДоставокДоКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b4cc6bd2-b207-434d-b027-c3ef416c447c">
    <name>Розничная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8cebbe69-bf66-4554-90d5-9fe9e46e6dbf">
    <name>СборнаяОРК</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4da8f5b7-705c-495c-976b-5d4823a1f879">
    <name>Внутренняя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e3544ba3-ce9f-46e6-9877-fa2b4b9656af">
    <name>ДистрибуцияСборныеГрузы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/КорректировкаДоставокВИнтервалах/КорректировкаДоставокВИнтервалах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="95f8db74-0749-436c-b1a9-ec710e5cc6af">
  <name>КорректировкаДоставокВИнтервалах</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="66a9d133-e39a-4d3e-a0bb-24b48fb05c57">
    <name>Интервал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b080db5e-4ea9-4254-8a06-cf8e0ce480f6">
    <name>КоличествоДоставок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d5a09345-75b8-4668-906c-be160e992a18">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad915c98-729e-46a2-931b-e9b70cd0c405">
    <name>ДатаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5f617744-b918-4938-8cc3-15782276b89b">
    <name>ДляРазгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

trade_exp/src/Catalogs/ИнтервалыДоставки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьТекстЗапросаДляВыбораИнтервала()  Экспорт   
		
		ТекстЗапроса= 
		"ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА ИспользованиеИнтерваловДоставки.Регистратор ССЫЛКА Документ.ЗаказНаДоставкуКлиенту
		|				ТОГДА ИспользованиеИнтерваловДоставки.Количество
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КолЗаказов,
		|	СУММА(ВЫБОР
		|			КОГДА ИспользованиеИнтерваловДоставки.Регистратор ССЫЛКА Документ.ЗаказНаДоставкуКлиенту
		|				ТОГДА ИспользованиеИнтерваловДоставки.КоличествоСРазгрузкой
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КолЗаказовСРазгрузкой,
		|	ИспользованиеИнтерваловДоставки.Интервал КАК Интервал
		|ПОМЕСТИТЬ КолДоставок
		|ИЗ
		|	РегистрНакопления.ИспользованиеИнтерваловДоставки КАК ИспользованиеИнтерваловДоставки
		|ГДЕ
		|	ИспользованиеИнтерваловДоставки.ДатаИспользования МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаОтгрузки, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОтгрузки, ДЕНЬ)
		|	И ИспользованиеИнтерваловДоставки.Подразделение = &Подразделение
		|	И ИспользованиеИнтерваловДоставки.ВидДоставки = &ВидДоставки
		//|	И ИспользованиеИнтерваловДоставки.ВидДоставки = ЗНАЧЕНИЕ(Перечисление.ВидыДоставокДоКлиента.Розничная)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИспользованиеИнтерваловДоставки.Интервал
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИспользованиеИнтерваловДоставки.Интервал КАК Интервал,
		|	ИспользованиеИнтерваловДоставки.ВидДоставки КАК ВидДоставки,
		|	ИспользованиеИнтерваловДоставки.ДатаИспользования КАК ДатаИспользования,
		|	ИспользованиеИнтерваловДоставки.ДляРазгрузки КАК ДляРазгрузки,
		|	ИспользованиеИнтерваловДоставки.Количество КАК Количество,
		|	ИспользованиеИнтерваловДоставки.КоличествоСРазгрузкой КАК КоличествоСРазгрузкой
		|ПОМЕСТИТЬ Корректировки
		|ИЗ
		|	РегистрНакопления.ИспользованиеИнтерваловДоставки КАК ИспользованиеИнтерваловДоставки
		|ГДЕ
		|	ИспользованиеИнтерваловДоставки.Регистратор ССЫЛКА Документ.КорректировкаДоставокВИнтервалах
		|	И ИспользованиеИнтерваловДоставки.ДатаИспользования МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаОтгрузки, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаОтгрузки, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИнтервалыДоставки.Ссылка КАК Ссылка,
		|	ИнтервалыДоставки.Наименование КАК Наименование,
		|	ИнтервалыДоставки.НаименованиеНаСайте КАК НаименованиеНаСайте,
		|	ИнтервалыДоставки.Тип.Код КАК КодТипаДоставки,
		|	ИнтервалыДоставки.Подразделение КАК Подразделение,
		|	ИнтервалыДоставки.ВремяС КАК ВремяС,
		|	ИнтервалыДоставки.ВремяПо КАК ВремяПо,
		|	ИнтервалыДоставки.КоличествоДоставок КАК КоличествоДоставок,
		|	ИнтервалыДоставки.ДеньНедели КАК ДЕНЬНЕДЕЛИ,
		|	ИнтервалыДоставки.ИнтервалЗакрытия КАК ИнтервалЗакрытия,
		|	ВЫБОР
		|		КОГДА &ДоставкаСРазгрузкой
		|			ТОГДА ИнтервалыДоставки.ЗакрытиеИнтервалаПоРазгрузке
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ЗакрытиеИнтервалаПоРазгрузке,
		|	ИнтервалыДоставки.МксКолДоставокСРазгрузкой КАК МксКолДоставокСРазгрузкой,
		|	ИнтервалыДоставки.ЗакрытиеИнтервалаПоРазгрузке КАК ИнтервалЗакрытияРазгрузка,
		|	ИнтервалыДоставки.ДатаНачала КАК ДатаНачала,
		|	ИнтервалыДоставки.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ИнтервалыДоставки
		|ИЗ
		|	Справочник.ИнтервалыДоставки КАК ИнтервалыДоставки
		|ГДЕ
		|	ИнтервалыДоставки.Подразделение = &Подразделение
		|	И ИнтервалыДоставки.ДеньНедели = &ДеньНедели
		|	И ИнтервалыДоставки.ПометкаУдаления = ЛОЖЬ
		|	И ИнтервалыДоставки.ВидДоставки = &ВидДоставки
		|	И &ВидДоставки = ЗНАЧЕНИЕ(Перечисление.ВидыДоставокДоКлиента.Розничная)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИнтервалыДоставки.Ссылка,
		|	ИнтервалыДоставки.Наименование,
		|	ИнтервалыДоставки.НаименованиеНаСайте,
		|	ИнтервалыДоставки.Тип.Код,
		|	ИнтервалыДоставки.Подразделение,
		|	ИнтервалыДоставки.ВремяС,
		|	ИнтервалыДоставки.ВремяПо,
		|	ИнтервалыДоставки.КоличествоДоставок,
		|	ИнтервалыДоставки.ДеньНедели,
		|	ИнтервалыДоставки.ИнтервалЗакрытия,
		|	ВЫБОР
		|		КОГДА &ДоставкаСРазгрузкой
		|			ТОГДА ИнтервалыДоставки.ЗакрытиеИнтервалаПоРазгрузке
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ,
		|	ИнтервалыДоставки.МксКолДоставокСРазгрузкой,
		|	ИнтервалыДоставки.ЗакрытиеИнтервалаПоРазгрузке,
		|	ИнтервалыДоставки.ДатаНачала,
		|	ИнтервалыДоставки.ДатаОкончания
		|ИЗ
		|	Справочник.ИнтервалыДоставки КАК ИнтервалыДоставки
		|ГДЕ
		|	ИнтервалыДоставки.Подразделение = &Подразделение
		|	И ИнтервалыДоставки.ДеньНедели = 0
		|	И ИнтервалыДоставки.ПометкаУдаления = ЛОЖЬ
		|	И &ВидДоставки = ЗНАЧЕНИЕ(Перечисление.ВидыДоставокДоКлиента.СборнаяОРК)
		|	И ИнтервалыДоставки.ВидДоставки = &ВидДоставки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИнтервалыДоставки.Ссылка,
		|	ИнтервалыДоставки.Наименование,
		|	ИнтервалыДоставки.НаименованиеНаСайте,
		|	ИнтервалыДоставки.Тип.Код,
		|	ИнтервалыДоставки.Подразделение,
		|	ИнтервалыДоставки.ВремяС,
		|	ИнтервалыДоставки.ВремяПо,
		|	ИнтервалыДоставки.КоличествоДоставок,
		|	ИнтервалыДоставки.ДеньНедели,
		|	ИнтервалыДоставки.ИнтервалЗакрытия,
		|	ВЫБОР
		|		КОГДА &ДоставкаСРазгрузкой
		|			ТОГДА ИнтервалыДоставки.ЗакрытиеИнтервалаПоРазгрузке
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ,
		|	ИнтервалыДоставки.МксКолДоставокСРазгрузкой,
		|	ИнтервалыДоставки.ЗакрытиеИнтервалаПоРазгрузке,
		|	ИнтервалыДоставки.ДатаНачала,
		|	ИнтервалыДоставки.ДатаОкончания
		|ИЗ
		|	Справочник.ИнтервалыДоставки КАК ИнтервалыДоставки
		|ГДЕ
		|	ИнтервалыДоставки.Подразделение = &Подразделение
		|	И ИнтервалыДоставки.ДеньНедели = &ДеньНедели
		|	И ИнтервалыДоставки.ПометкаУдаления = ЛОЖЬ
		|	И &ВидДоставки = ЗНАЧЕНИЕ(Перечисление.ВидыДоставокДоКлиента.СборнаяОРК)
		|	И ИнтервалыДоставки.ВидДоставки = &ВидДоставки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИнтервалыДоставки.Ссылка,
		|	ИнтервалыДоставки.Наименование,
		|	ИнтервалыДоставки.НаименованиеНаСайте,
		|	ИнтервалыДоставки.Тип.Код,
		|	ИнтервалыДоставки.Подразделение,
		|	ИнтервалыДоставки.ВремяС,
		|	ИнтервалыДоставки.ВремяПо,
		|	ИнтервалыДоставки.КоличествоДоставок,
		|	ИнтервалыДоставки.ДеньНедели,
		|	ИнтервалыДоставки.ИнтервалЗакрытия,
		|	ВЫБОР
		|		КОГДА &ДоставкаСРазгрузкой
		|			ТОГДА ИнтервалыДоставки.ЗакрытиеИнтервалаПоРазгрузке
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ,
		|	ИнтервалыДоставки.МксКолДоставокСРазгрузкой,
		|	ИнтервалыДоставки.ЗакрытиеИнтервалаПоРазгрузке,
		|	ИнтервалыДоставки.ДатаНачала,
		|	ИнтервалыДоставки.ДатаОкончания
		|ИЗ
		|	Справочник.ИнтервалыДоставки КАК ИнтервалыДоставки
		|ГДЕ
		|	ИнтервалыДоставки.Подразделение = &Подразделение
		|	И ИнтервалыДоставки.ДеньНедели = 0
		|	И ИнтервалыДоставки.ПометкаУдаления = ЛОЖЬ
		|	И &ВидДоставки = ЗНАЧЕНИЕ(Перечисление.ВидыДоставокДоКлиента.Внутренняя)
		|	И ИнтервалыДоставки.ВидДоставки = &ВидДоставки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИнтервалыДоставки.Ссылка,
		|	ИнтервалыДоставки.Наименование,
		|	ИнтервалыДоставки.НаименованиеНаСайте,
		|	ИнтервалыДоставки.Тип.Код,
		|	ИнтервалыДоставки.Подразделение,
		|	ИнтервалыДоставки.ВремяС,
		|	ИнтервалыДоставки.ВремяПо,
		|	ИнтервалыДоставки.КоличествоДоставок,
		|	ИнтервалыДоставки.ДеньНедели,
		|	ИнтервалыДоставки.ИнтервалЗакрытия,
		|	ВЫБОР
		|		КОГДА &ДоставкаСРазгрузкой
		|			ТОГДА ИнтервалыДоставки.ЗакрытиеИнтервалаПоРазгрузке
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ,
		|	ИнтервалыДоставки.МксКолДоставокСРазгрузкой,
		|	ИнтервалыДоставки.ЗакрытиеИнтервалаПоРазгрузке,
		|	ИнтервалыДоставки.ДатаНачала,
		|	ИнтервалыДоставки.ДатаОкончания
		|ИЗ
		|	Справочник.ИнтервалыДоставки КАК ИнтервалыДоставки
		|ГДЕ
		|	ИнтервалыДоставки.Подразделение = &Подразделение
		|	И ИнтервалыДоставки.ДеньНедели = &ДеньНедели
		|	И ИнтервалыДоставки.ПометкаУдаления = ЛОЖЬ
		|	И &ВидДоставки = ЗНАЧЕНИЕ(Перечисление.ВидыДоставокДоКлиента.Внутренняя)
		|	И ИнтервалыДоставки.ВидДоставки = &ВидДоставки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИнтервалыДоставки.Ссылка,
		|	ИнтервалыДоставки.Наименование,
		|	ИнтервалыДоставки.НаименованиеНаСайте,
		|	ИнтервалыДоставки.Тип.Код,
		|	ИнтервалыДоставки.Подразделение,
		|	ИнтервалыДоставки.ВремяС,
		|	ИнтервалыДоставки.ВремяПо,
		|	ИнтервалыДоставки.КоличествоДоставок,
		|	ИнтервалыДоставки.ДеньНедели,
		|	ИнтервалыДоставки.ИнтервалЗакрытия,
		|	ВЫБОР
		|		КОГДА &ДоставкаСРазгрузкой
		|			ТОГДА ИнтервалыДоставки.ЗакрытиеИнтервалаПоРазгрузке
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ,
		|	ИнтервалыДоставки.МксКолДоставокСРазгрузкой,
		|	ИнтервалыДоставки.ЗакрытиеИнтервалаПоРазгрузке,
		|	ИнтервалыДоставки.ДатаНачала,
		|	ИнтервалыДоставки.ДатаОкончания
		|ИЗ
		|	Справочник.ИнтервалыДоставки КАК ИнтервалыДоставки
		|ГДЕ
		|	ИнтервалыДоставки.Подразделение = &Подразделение
		|	И ИнтервалыДоставки.ДеньНедели = 0
		|	И ИнтервалыДоставки.ПометкаУдаления = ЛОЖЬ
		|	И &ВидДоставки = ЗНАЧЕНИЕ(Перечисление.ВидыДоставокДоКлиента.ДистрибуцияСборныеГрузы)
		|	И ИнтервалыДоставки.ВидДоставки = &ВидДоставки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИнтервалыДоставки.Ссылка,
		|	ИнтервалыДоставки.Наименование,
		|	ИнтервалыДоставки.НаименованиеНаСайте,
		|	ИнтервалыДоставки.Тип.Код,
		|	ИнтервалыДоставки.Подразделение,
		|	ИнтервалыДоставки.ВремяС,
		|	ИнтервалыДоставки.ВремяПо,
		|	ИнтервалыДоставки.КоличествоДоставок,
		|	ИнтервалыДоставки.ДеньНедели,
		|	ИнтервалыДоставки.ИнтервалЗакрытия,
		|	ВЫБОР
		|		КОГДА &ДоставкаСРазгрузкой
		|			ТОГДА ИнтервалыДоставки.ЗакрытиеИнтервалаПоРазгрузке
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ,
		|	ИнтервалыДоставки.МксКолДоставокСРазгрузкой,
		|	ИнтервалыДоставки.ЗакрытиеИнтервалаПоРазгрузке,
		|	ИнтервалыДоставки.ДатаНачала,
		|	ИнтервалыДоставки.ДатаОкончания
		|ИЗ
		|	Справочник.ИнтервалыДоставки КАК ИнтервалыДоставки
		|ГДЕ
		|	ИнтервалыДоставки.Подразделение = &Подразделение
		|	И ИнтервалыДоставки.ДеньНедели = &ДеньНедели
		|	И ИнтервалыДоставки.ПометкаУдаления = ЛОЖЬ
		|	И &ВидДоставки = ЗНАЧЕНИЕ(Перечисление.ВидыДоставокДоКлиента.ДистрибуцияСборныеГрузы)
		|	И ИнтервалыДоставки.ВидДоставки = &ВидДоставки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИнтервалыДоставки.Ссылка КАК Ссылка,
		|	ИнтервалыДоставки.НаименованиеНаСайте КАК НаименованиеНаСайте,
		|	ИнтервалыДоставки.КодТипаДоставки КАК КодТипаДоставки,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Корректировки.Количество, """") = """"
		|			ТОГДА ИнтервалыДоставки.КоличествоДоставок - ЕСТЬNULL(КолДоставок.КолЗаказов, 0)
		|		ИНАЧЕ Корректировки.Количество - ЕСТЬNULL(КолДоставок.КолЗаказов, 0)
		|	КОНЕЦ КАК ДоступноНаСегодня,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(КорректировкиДляРазгрузки.КоличествоСРазгрузкой, """") = """"
		|			ТОГДА ИнтервалыДоставки.МксКолДоставокСРазгрузкой - ЕСТЬNULL(КолДоставок.КолЗаказовСРазгрузкой, 0)
		|		ИНАЧЕ КорректировкиДляРазгрузки.КоличествоСРазгрузкой - ЕСТЬNULL(КолДоставок.КолЗаказовСРазгрузкой, 0)
		|	КОНЕЦ КАК ДоступноНаСегодняСРазгрузкой,
		|	ИнтервалыДоставки.МксКолДоставокСРазгрузкой - ЕСТЬNULL(КолДоставок.КолЗаказовСРазгрузкой, 0) КАК ДоступноНаСегодняСРазгрузкой1,
		|	ИнтервалыДоставки.КоличествоДоставок КАК КоличествоПоУмолчанию,
		|	ЕСТЬNULL(Корректировки.Количество, 0) КАК СкорректированноеКоличество,
		|	ЕСТЬNULL(КорректировкиДляРазгрузки.КоличествоСРазгрузкой, 0) КАК СкорректированноеКоличествоСРазгрузкой,
		|	ИнтервалыДоставки.МксКолДоставокСРазгрузкой КАК КоличествоСРазгрузкойПоУмолчанию,
		|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаОтгрузки, ДЕНЬ), МИНУТА, ЧАС(ИнтервалыДоставки.ВремяС) * 60 + МИНУТА(ИнтервалыДоставки.ВремяС)) КАК ДатаИнтервала,
		|	ЕСТЬNULL(КолДоставок.КолЗаказов, 0) КАК КолЗаказов,
		|	ЕСТЬNULL(КолДоставок.КолЗаказовСРазгрузкой, 0) КАК КолЗаказовСРазгрузкой,
		|	&ТекДата КАК ТекДата,
		|	ИнтервалыДоставки.Подразделение КАК Подразделение,
		|	ИнтервалыДоставки.ВремяС КАК ВремяС,
		|	ИнтервалыДоставки.ВремяПо КАК ВремяПо,
		|	ИнтервалыДоставки.ДЕНЬНЕДЕЛИ КАК ДЕНЬНЕДЕЛИ,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА &ДоставкаСРазгрузкой
		|				ТОГДА ИнтервалыДоставки.ЗакрытиеИнтервалаПоРазгрузке
		|			ИНАЧЕ ИнтервалыДоставки.ИнтервалЗакрытия
		|		КОНЕЦ КАК ЧИСЛО(4, 0)) КАК ИнтервалЗакрытия,
		|	ИнтервалыДоставки.Наименование КАК Наименование,
		|	Корректировки.ДатаИспользования КАК ДатаДействия,
		|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаОтгрузки, ДЕНЬ), МИНУТА, ЧАС(ИнтервалыДоставки.ВремяПо) * 60 + МИНУТА(ИнтервалыДоставки.ВремяПо)) КАК ДатаИнтервалаКон,
		|	ВЫРАЗИТЬ(ИнтервалыДоставки.ИнтервалЗакрытияРазгрузка КАК ЧИСЛО(4, 0)) КАК ИнтервалЗакрытияРазгрузка
		|ПОМЕСТИТЬ ВТ_Результат1
		|ИЗ
		|	ИнтервалыДоставки КАК ИнтервалыДоставки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Корректировки КАК Корректировки
		|		ПО (Корректировки.Интервал = ИнтервалыДоставки.Ссылка)
		|			И (Корректировки.ДляРазгрузки = ЛОЖЬ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Корректировки КАК КорректировкиДляРазгрузки
		|		ПО (КорректировкиДляРазгрузки.Интервал = ИнтервалыДоставки.Ссылка)
		|			И (КорректировкиДляРазгрузки.ДляРазгрузки = ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ КолДоставок КАК КолДоставок
		|		ПО (КолДоставок.Интервал = ИнтервалыДоставки.Ссылка)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ИнтервалыДоставки.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИнтервалыДоставки.ДатаНачала <= &ДатаОтгрузки
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА ИнтервалыДоставки.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИнтервалыДоставки.ДатаОкончания >= &ДатаОтгрузки
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Результат1.Ссылка КАК Ссылка,
		|	Результат1.Наименование КАК Наименование,
		|	Результат1.НаименованиеНаСайте КАК НаименованиеНаСайте,
		|	Результат1.КодТипаДоставки КАК КодТипаДоставки,
		|	ВЫБОР
		|		КОГДА Результат1.Ссылка.ЗакрыватьСКонцаИнтервала
		|			ТОГДА ВЫБОР
		|					КОГДА РАЗНОСТЬДАТ(Результат1.ТекДата, Результат1.ДатаИнтервалаКон, МИНУТА) < Результат1.ИнтервалЗакрытия + &КорИнтервала
		|						ТОГДА ЛОЖЬ
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РАЗНОСТЬДАТ(Результат1.ТекДата, Результат1.ДатаИнтервала, МИНУТА) < Результат1.ИнтервалЗакрытия + &КорИнтервала
		|					ТОГДА ЛОЖЬ
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|	КОНЕЦ КАК МожноВыбрать,
		|	Результат1.ДоступноНаСегодня КАК ДоступноНаСегодня,
		|	Результат1.ДоступноНаСегодняСРазгрузкой КАК ДоступноНаСегодняСРазгрузкой,
		|	Результат1.ДатаИнтервала КАК ДатаИнтервала,
		|	Результат1.ДатаИнтервалаКон КАК ДатаИнтервалаКон,
		|	Результат1.ТекДата КАК ТекДата,
		|	Результат1.КоличествоПоУмолчанию КАК КоличествоПоУмолчанию,
		|	ВЫРАЗИТЬ(Результат1.СкорректированноеКоличество КАК ЧИСЛО(3, 0)) КАК СкорректированноеКоличество,
		|	Результат1.КоличествоСРазгрузкойПоУмолчанию КАК КоличествоСРазгрузкойПоУмолчанию,
		|	Результат1.СкорректированноеКоличествоСРазгрузкой КАК СкорректированноеКоличествоСРазгрузкой,
		|	Результат1.КолЗаказов КАК ЗаказовЗаСегодня,
		|	Результат1.КолЗаказовСРазгрузкой КАК ЗаказовСРазгрузкойЗаСегодя,
		|	Результат1.ИнтервалЗакрытия КАК ИнтервалЗакрытия,
		|	РАЗНОСТЬДАТ(Результат1.ТекДата, Результат1.ДатаИнтервала, МИНУТА) КАК РАЗНОСТЬДАТ,
		|	Результат1.ВремяС КАК ВремяС,
		|	Результат1.ВремяПо КАК ВремяПо,
		|	Результат1.ДЕНЬНЕДЕЛИ КАК ДЕНЬНЕДЕЛИ,
		|	Результат1.Ссылка.ЗакрыватьСКонцаИнтервала КАК ЗакрыватьСКонцаИнтервала,
		|	ВЫБОР
		|		КОГДА Результат1.Ссылка.ЗакрыватьСКонцаИнтервала
		|			ТОГДА ВЫБОР
		|					КОГДА РАЗНОСТЬДАТ(Результат1.ТекДата, Результат1.ДатаИнтервалаКон, МИНУТА) < Результат1.ИнтервалЗакрытияРазгрузка + &КорИнтервала
		|						ТОГДА ЛОЖЬ
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РАЗНОСТЬДАТ(Результат1.ТекДата, Результат1.ДатаИнтервала, МИНУТА) < Результат1.ИнтервалЗакрытияРазгрузка + &КорИнтервала
		|					ТОГДА ЛОЖЬ
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|	КОНЕЦ КАК МожноВыбратьРазгрузка
		|ПОМЕСТИТЬ ВТ_Результат2
		|ИЗ
		|	ВТ_Результат1 КАК Результат1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Результат2.Ссылка) КАК УИД,
		|	Результат2.Ссылка КАК Ссылка,
		|	Результат2.Наименование КАК Наименование,
		|	Результат2.НаименованиеНаСайте КАК НаименованиеНаСайте,
		|	Результат2.КодТипаДоставки КАК КодТипаДоставки,
		|	Результат2.МожноВыбрать КАК МожноВыбрать,
		|	Результат2.ДоступноНаСегодня КАК ДоступноНаСегодня,
		|	Результат2.ДоступноНаСегодняСРазгрузкой КАК ДоступноНаСегодняСРазгрузкой,
		|	Результат2.ДатаИнтервала КАК ДатаИнтервала,
		|	Результат2.ДатаИнтервалаКон КАК ДатаИнтервалаКон,
		|	Результат2.ТекДата КАК ТекДата,
		|	Результат2.КоличествоПоУмолчанию КАК КоличествоПоУмолчанию,
		|	Результат2.СкорректированноеКоличество КАК СкорректированноеКоличество,
		|	Результат2.КоличествоСРазгрузкойПоУмолчанию КАК КоличествоСРазгрузкойПоУмолчанию,
		|	Результат2.СкорректированноеКоличествоСРазгрузкой КАК СкорректированноеКоличествоСРазгрузкой,
		|	Результат2.ЗаказовЗаСегодня КАК ЗаказовЗаСегодня,
		|	Результат2.ЗаказовСРазгрузкойЗаСегодя КАК ЗаказовСРазгрузкойЗаСегодя,
		|	Результат2.ИнтервалЗакрытия КАК ИнтервалЗакрытия,
		|	Результат2.РАЗНОСТЬДАТ КАК РАЗНОСТЬДАТ,
		|	Результат2.ВремяС КАК ВремяС,
		|	Результат2.ВремяПо КАК ВремяПо,
		|	Результат2.ДЕНЬНЕДЕЛИ КАК ДЕНЬНЕДЕЛИ,
		|	Результат2.ЗакрыватьСКонцаИнтервала КАК ЗакрыватьСКонцаИнтервала,
		|	Результат2.МожноВыбратьРазгрузка КАК МожноВыбратьРазгрузка,
		|	ВЫБОР
		|		КОГДА &ДоставкаСРазгрузкой
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ Результат2.МожноВыбратьРазгрузка
		|							ИЛИ Результат2.ДоступноНаСегодняСРазгрузкой <= 0
		|							ИЛИ Результат2.ДоступноНаСегодня <= 0
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НЕ Результат2.МожноВыбрать
		|						ИЛИ Результат2.ДоступноНаСегодня <= 0
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|	КОНЕЦ КАК Закрыт,
		|	Результат2.Ссылка.Родитель КАК Родитель
		|ИЗ
		|	ВТ_Результат2 КАК Результат2";
		
		Возврат ТекстЗапроса;  
		
	КонецФункции
#КонецЕсли
